000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ДанныеПластиковыхКарт/ДанныеПластиковыхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПластиковыхКарт</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЧекККМ</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПластиковойКарты</name>
    <type>
      <types>EnumRef.ТипыПластиковыхКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ДанныеПластиковыхКарт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Струкура данных для записи.
// 
// Возвращаемое значение:
//  Структура - Струкура данных для записи:
// * ЧекККМ - ДокументСсылка.ЧекККМ - 
// * Контрагент - СправочникСсылка.Контрагенты - 
// * ТипПластиковойКарты - ПеречислениеСсылка.ТипыПластиковыхКарт - 
// * Сумма - Число - 
Функция СтрукураДанныхДляЗаписи() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЧекККМ", Документы.ЧекККМ.ПустаяСсылка());
	Результат.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	Результат.Вставить("ТипПластиковойКарты", Перечисления.ТипыПластиковыхКарт.ПустаяСсылка());
	Результат.Вставить("Сумма", 0);
	
	Возврат Результат;
	
КонецФункции

// Записать данные оплаты.
// 
// Параметры:
//  ДанныеДляЗаписи - см. СтрукураДанныхДляЗаписи
Процедура ЗаписатьДанныеОплаты(ДанныеДляЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЧекККМ.Установить(ДанныеДляЗаписи.ЧекККМ);
	НаборЗаписей.Отбор.ТипПластиковойКарты.Установить(ДанныеДляЗаписи.ТипПластиковойКарты);

	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.ЧекККМ = ДанныеДляЗаписи.ЧекККМ;
	НоваяСтрока.Контрагент = ДанныеДляЗаписи.Контрагент;
	НоваяСтрока.ТипПластиковойКарты = ДанныеДляЗаписи.ТипПластиковойКарты;
	НоваяСтрока.Сумма = ДанныеДляЗаписи.Сумма;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Очистить регистр.
// 
// Параметры:
//  ДанныеДляЗаписи - см. СтрукураДанныхДляЗаписи
Процедура ОчиститьРегистр(ДанныеДляЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЧекККМ.Установить(ДанныеДляЗаписи.ЧекККМ);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
